export const data = {
    item: {
        quantity: 3,
        charge: 1,
        duration: 2,
        induction: 5,
        size: 0.1,
    },
    confines: {
        quantity: {
            min: 1,
            max: 50,
        },
        duration: {
            min: 1,
            max: 10,
        },
        induction: {
            min: 1,
            max: 20,
        },
        size: {
            min: 0.05,
            max: 0.5,
        },
    },
    fields: [
        {
            type: 'input',
            name: 'quantity',
            label: 'Колличество частиц, ед',
        },
        {
            type: 'input',
            name: 'size',
            label: 'Размер частиц',
        },
        {
            type: 'input',
            name: 'duration',
            label: 'Скорость, Мм/сек',
        },
        {
            type: 'input',
            name: 'induction',
            label: 'Индукция магнитного поля, 10 <sup>−5</sup> Тл',
        },
        {
            type: 'select',
            options: {
                1: 'Положительный',
                0: 'Отрицательный',
            },
            name: 'charge',
            label: 'Заряд частиц',
        },
    ],
    title: 'Движение частиц с одинаковым радиусом',
    theory: {
        title: 'Движение частиц с одинаковым радиусом',
        text: `<span>
                <p>
                    На заряженную частицу движущеюся в магнитном поле действут сила
                    Лоренса. Она перпендикулярна к вектору скорости и к вектору
                    индукции. Если скорость перпендикулярна к магнитному полю, частица
                    движется по окружности.
                </p>
                <p>
                    Радиус этой окружности зависит от заряда этой частицы, ее скорости и
                    индукции магнитного поля. Период обращения частицы зависит от массы,
                    заряда частицы, индукции поля. Но не зависит от скорости частицы.
                </p>
                <p>
                    Если векторы скорости отличаются лишь по направлению, то частиц
                    будут описывать окружности одинакового радиуса. Если скорости
                    различны по величине, то различными будут и радиусы окружностей, но
                    периоды обращения будут одинаковыми. С увеличением индукции поля
                    радиус окружности, а следовательно и период обращения, уменьшаются.
                </p>
            </span>`,
    },
};